УправлениеПаркомАттракционов/src/Documents/ШкалаБонуснойПрограммы/ШкалаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ШкалаБонуснойПрограммы</name>
  <registerRecords>InformationRegister.АктуальнаяШкалаБонуснойПрограммы</registerRecords>
  <tabularSections>
    <name>Диапазоны</name>
    <attributes>
      <name>НижняяГраницаПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраницаПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНакопления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеПаркомАттракционов/src/InformationRegisters/АктуальнаяШкалаБонуснойПрограммы/АктуальнаяШкалаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальнаяШкалаБонуснойПрограммы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Шкала</name>
    <type>
      <types>DocumentRef.ШкалаБонуснойПрограммы</types>
    </type>
  </resources>
</mdclass:InformationRegister>

УправлениеПаркомАттракционов/src/Documents/ШкалаБонуснойПрограммы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр АктуальнаяШкалаБонуснойПрограммы
	Движения.АктуальнаяШкалаБонуснойПрограммы.Записывать = Истина;
	Движение = Движения.АктуальнаяШкалаБонуснойПрограммы.Добавить();
	Движение.Период = Дата;
	Движение.Шкала = Ссылка;

КонецПроцедуры



Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//1. Нижняя граница первого диапазона должна быть равна 0
	//2. Верхняя граница каждого диапазона, кроме последнего, должна быть равна нижней следующего
	//3. Верхняя граница последнего диапазона должна быть равна 0
	//4. Верхняя граница всегда больше нижней границы (кроме последнего диапазона)
	
	Если Диапазоны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Диапазоны[0].НижняяГраницаПродаж <> 0 Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Нижняя граница первого диапазона должна быть равна 0");
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = "Диапазоны[0].НижняяГраница";
				Сообщение.Сообщить();
	КонецЕсли;
	
	ВерхняяГраницаПредыдущегоДиапазона = 0;
	
	Для Сч = 0 По Диапазоны.Количество() - 1 Цикл
		
		Диапазон = Диапазоны[Сч];
		
		Если Сч > 0 Тогда
				Если Диапазон.НижняяГраницаПродаж <> ВерхняяГраницаПредыдущегоДиапазона Тогда
						
						Отказ = Истина;
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Верхняя граница диапазона должна быть равна нижней границе следующего");
						Сообщение.УстановитьДанные(ЭтотОбъект);
						Сообщение.Поле = СтрШаблон("Диапазоны[%1], НижняяГраница", XMLСтрока(Сч));
						Сообщение.Сообщить();
						
				КонецЕсли;
		КонецЕсли;
		
		Если Диапазон.НижняяГраницаПродаж >= Диапазон.ВерхняяГраницаПродаж 
		И Сч <> Диапазоны.Количество () - 1 Тогда
			
						Отказ = Истина;
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Верхняя граница должна быть больше нижней границы");
						Сообщение.УстановитьДанные(ЭтотОбъект);
						Сообщение.Поле = СтрШаблон("Диапазоны[%1], ВерхняяГраница", XMLСтрока(Сч));
						Сообщение.Сообщить();
		
		КонецЕсли;
			
		ВерхняяГраницаПредыдущегоДиапазона = Диапазон.ВерхняяГраницаПродаж;
		
	КонецЦикла;
	
	ПоследнийДиапазон = Диапазоны[Диапазоны.Количество() - 1];
	
	Если ПоследнийДиапазон.ВерхняяГраницаПродаж <> 0 Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Нижняя граница первого диапазона должна быть равна 0");
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = СтрШаблон("Диапазоны[%1], ВерхняяГраница", XMLСтрока(Диапазоны.Количество() - 1));
				Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
